Revit 2024 API
STLExportOptions Constructor (ExportResolution)
 Constructs a new instance of STLExportOptions with all predefined tessellation settings, depending on export resolution type. Note: in case of Custom resolution type, tessellation settings won't be predefined and will have default values.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021.1
Syntax
C#
public STLExportOptions(
	ExportResolution resolutionType
)
Visual Basic
Public Sub New ( _
	resolutionType As ExportResolution _
)
Visual C++
public:
STLExportOptions(
	ExportResolution resolutionType
)
Parameters
resolutionType
Type: Autodesk.Revit.DB.ExportResolution
 The type of export resolution.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
STLExportOptions Class
STLExportOptions Overload
Autodesk.Revit.DB Namespace